pokedex-rails-backend/app/controllers/api/pokemon_controller.rb

  def show
    @pokemon = Pokemon.find_by(id: params[:id])
---
SELECT "pokemons".* FROM "pokemons" WHERE "pokemons"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]